# vi: ft=ruby

tap "heroku/brew"
tap "universal-ctags/universal-ctags"
tap "nodenv/nodenv"

brew "asdf"
brew "bash"
brew "bash-completion"
brew "coreutils" # gmkdir core for Rails 8
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "gpgme"
brew "jq"
brew "lua"
brew "nodenv"
brew "node-build"
brew "peon-ping"
brew "pnpm"
brew "ripgrep"
brew "ruby-build"
brew "starship"
brew "sqlite"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags"
brew "uv"
brew "vim"
brew "wget"
brew "yarn"
brew "z"

# Postgres
brew "libpq"
brew "heroku/brew/heroku"

cask "claude-code"
cask "discord"
cask "google-chrome"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "pgadmin4"
cask "postgres-unofficial"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
